mbraudio/ampx_nrf52/ble_rws.c
#include "ble_rws.h"
#include "ble.h"
#include "sdk_common.h"
#include "ble_srv_common.h"
#include "nrf_log.h"


#define BLE_UUID_RWS_RX_CHARACTERISTIC 0x87F6              /**< The UUID of the RX Characteristic. */
#define BLE_UUID_RWS_TX_CHARACTERISTIC 0x88F7              /**< The UUID of the TX Characteristic. */


#define BLE_RWS_MAX_RX_CHAR_LEN        BLE_RWS_MAX_DATA_LEN /**< Maximum length of the RX Characteristic (in bytes). */
#define BLE_RWS_MAX_TX_CHAR_LEN        BLE_RWS_MAX_DATA_LEN /**< Maximum length of the TX Characteristic (in bytes). */

#define RWS_BASE_UUID                  {{0x42, 0x19, 0x8B, 0x49, 0xE4, 0x1C, 0x45, 0x3B, 0xB0, 0x0E, 0x03, 0xEC, 0x00, 0x00, 0xBA, 0xCB}}


static void on_connect(ble_rws_t* p_rws, ble_evt_t const* p_ble_evt)
{
    ret_code_t                 err_code;
    ble_rws_evt_t              evt;
    ble_gatts_value_t          gatts_val;
    uint8_t                    cccd_value[2];
    ble_rws_client_context_t * p_client = NULL;

    err_code = blcm_link_ctx_get(p_rws->p_link_ctx_storage, p_ble_evt->evt.gap_evt.conn_handle, (void*)&p_client);
    if (err_code != NRF_SUCCESS)
    {
        NRF_LOG_ERROR("Link context for 0x%02X connection handle could not be fetched.", p_ble_evt->evt.gap_evt.conn_handle);
    }

    /* Check the hosts CCCD value to inform of readiness to send data using the RX characteristic */
    memset(&gatts_val, 0, sizeof(ble_gatts_value_t));
    gatts_val.p_value = cccd_value;
    gatts_val.len     = sizeof(cccd_value);
    gatts_val.offset  = 0;

    err_code = sd_ble_gatts_value_get(p_ble_evt->evt.gap_evt.conn_handle, p_rws->rx_handles.cccd_handle, &gatts_val);

    if ((err_code == NRF_SUCCESS) && (p_rws->data_handler != NULL) && ble_srv_is_notification_enabled(gatts_val.p_value))
    {
        if (p_client != NULL)
        {
            p_client->is_notification_enabled = true;
        }

        memset(&evt, 0, sizeof(ble_rws_evt_t));
        evt.type        = BLE_RWS_EVT_COMM_STARTED;
        evt.p_rws       = p_rws;
        evt.conn_handle = p_ble_evt->evt.gap_evt.conn_handle;
        evt.p_link_ctx  = p_client;
        p_rws->data_handler(&evt);
    }
}


static void on_write(ble_rws_t* p_rws, ble_evt_t const* p_ble_evt)
{
    // TODO: Optimize!!!

    ret_code_t                    err_code;
    ble_rws_evt_t                 evt;
    ble_rws_client_context_t    * p_client;
    ble_gatts_evt_write_t const * p_evt_write = &p_ble_evt->evt.gatts_evt.params.write;

    err_code = blcm_link_ctx_get(p_rws->p_link_ctx_storage, p_ble_evt->evt.gatts_evt.conn_handle, (void *) &p_client);
    if (err_code != NRF_SUCCESS)
    {
        NRF_LOG_ERROR("Link context for 0x%02X connection handle could not be fetched.", p_ble_evt->evt.gatts_evt.conn_handle);
    }

    memset(&evt, 0, sizeof(ble_rws_evt_t));
    evt.p_rws       = p_rws;
    evt.conn_handle = p_ble_evt->evt.gatts_evt.conn_handle;
    evt.p_link_ctx  = p_client;

    if ((p_evt_write->handle == p_rws->tx_handles.cccd_handle) && (p_evt_write->len == 2))
    {
        if (p_client != NULL)
        {
            if (ble_srv_is_notification_enabled(p_evt_write->data))
            {
                p_client->is_notification_enabled = true;
                evt.type                          = BLE_RWS_EVT_COMM_STARTED;
            }
            else
            {
                p_client->is_notification_enabled = false;
                evt.type                          = BLE_RWS_EVT_COMM_STOPPED;
            }

            if (p_rws->data_handler != NULL)
            {
                p_rws->data_handler(&evt);
            }

        }
    }
    else if ((p_evt_write->handle == p_rws->rx_handles.value_handle) && (p_rws->data_handler != NULL)) 
    {
        evt.type                  = BLE_RWS_EVT_RX_DATA;
        evt.params.rx_data.p_data = p_evt_write->data;
        evt.params.rx_data.length = p_evt_write->len;
        p_rws->data_handler(&evt);
    }
    else
    {
        // Do Nothing. This event is not relevant for this service.
    }
}


static void on_hvx_tx_complete(ble_rws_t * p_rws, ble_evt_t const * p_ble_evt)
{
    ret_code_t                 err_code;
    ble_rws_evt_t              evt;
    ble_rws_client_context_t * p_client;

    err_code = blcm_link_ctx_get(p_rws->p_link_ctx_storage, p_ble_evt->evt.gatts_evt.conn_handle, (void *) &p_client);
    if (err_code != NRF_SUCCESS)
    {
        NRF_LOG_ERROR("Link context for 0x%02X connection handle could not be fetched.", p_ble_evt->evt.gatts_evt.conn_handle);
        return;
    }

    if (p_client->is_notification_enabled)
    {
        memset(&evt, 0, sizeof(ble_rws_evt_t));
        evt.type        = BLE_RWS_EVT_TX_RDY;
        evt.p_rws       = p_rws;
        evt.conn_handle = p_ble_evt->evt.gatts_evt.conn_handle;
        evt.p_link_ctx  = p_client;
        p_rws->data_handler(&evt);
    }
}

void ble_rws_on_ble_evt(ble_evt_t const* p_ble_evt, void* p_context)
{
    if ((p_context == NULL) || (p_ble_evt == NULL))
    {
        NRF_LOG_INFO("ERROR ON: ble_rws_on_ble_evt !!!");
        return;
    }

    ble_rws_t* p_rws = (ble_rws_t *)p_context;

    //NRF_LOG_INFO("EVENT: ble_rws_on_ble_evt, id: 0x%02X", p_ble_evt->header.evt_id);

    switch (p_ble_evt->header.evt_id)
    {
        case BLE_GAP_EVT_CONNECTED:
            on_connect(p_rws, p_ble_evt);
            break;

        case BLE_GATTS_EVT_WRITE:
            NRF_LOG_INFO("EVENT: WRITE");
            on_write(p_rws, p_ble_evt);
            break;

        case BLE_GATTS_EVT_HVN_TX_COMPLETE:
            on_hvx_tx_complete(p_rws, p_ble_evt);
            break;

        case BLE_GATTC_EVT_EXCHANGE_MTU_RSP:
        {
            //NRF_LOG_INFO("BLE_GATTC_EVT_EXCHANGE_MTU_RSP");
        } break;

        case BLE_GAP_OPT_AUTH_PAYLOAD_TIMEOUT:
        {
            //NRF_LOG_INFO("BLE_GAP_OPT_AUTH_PAYLOAD_TIMEOUT");
        } break;

        default:
            //NRF_LOG_INFO("DEFAULT id: 0x%02X | %d", p_ble_evt->header.evt_id, p_ble_evt->header.evt_id);
            // No implementation needed.
            break;
    }
}

uint32_t ble_rws_init(ble_rws_t * p_rws, ble_rws_init_t const * p_rws_init)
{
    ret_code_t            err_code;
    ble_uuid_t            ble_uuid;
    ble_uuid128_t         rws_base_uuid = RWS_BASE_UUID;
    ble_add_char_params_t add_char_params;

    VERIFY_PARAM_NOT_NULL(p_rws);
    VERIFY_PARAM_NOT_NULL(p_rws_init);

    // Initialize the service structure.
    p_rws->data_handler = p_rws_init->data_handler;

    /**@snippet [Adding proprietary Service to the SoftDevice] */
    // Add a custom base UUID.
    err_code = sd_ble_uuid_vs_add(&rws_base_uuid, &p_rws->uuid_type);
    VERIFY_SUCCESS(err_code);

    ble_uuid.type = p_rws->uuid_type;
    ble_uuid.uuid = BLE_UUID_RWS_SERVICE;

    // Add the service.
    err_code = sd_ble_gatts_service_add(BLE_GATTS_SRVC_TYPE_PRIMARY, &ble_uuid, &p_rws->service_handle);
    /**@snippet [Adding proprietary Service to the SoftDevice] */
    VERIFY_SUCCESS(err_code);

    // Add the RX Characteristic.
    memset(&add_char_params, 0, sizeof(add_char_params));
    add_char_params.uuid                     = BLE_UUID_RWS_RX_CHARACTERISTIC;
    add_char_params.uuid_type                = p_rws->uuid_type;
    add_char_params.max_len                  = BLE_RWS_MAX_RX_CHAR_LEN;
    add_char_params.init_len                 = sizeof(uint8_t);
    add_char_params.is_var_len               = true;
    add_char_params.char_props.write         = 1;
    add_char_params.char_props.write_wo_resp = 1;
    add_char_params.char_props.notify = 1;

    add_char_params.read_access  = SEC_OPEN;
    add_char_params.write_access = SEC_OPEN;
    add_char_params.cccd_write_access = SEC_OPEN;

    err_code = characteristic_add(p_rws->service_handle, &add_char_params, &p_rws->rx_handles);
    if (err_code != NRF_SUCCESS)
    {
        return err_code;
    }

    // Add the TX Characteristic.
    /**@snippet [Adding proprietary characteristic to the SoftDevice] */
    memset(&add_char_params, 0, sizeof(add_char_params));
    add_char_params.uuid              = BLE_UUID_RWS_TX_CHARACTERISTIC;
    add_char_params.uuid_type         = p_rws->uuid_type;
    add_char_params.max_len           = BLE_RWS_MAX_TX_CHAR_LEN;
    add_char_params.init_len          = sizeof(uint8_t);
    add_char_params.is_var_len        = true;
    add_char_params.char_props.notify = 1;

    add_char_params.read_access       = SEC_OPEN;
    add_char_params.write_access      = SEC_OPEN;
    add_char_params.cccd_write_access = SEC_OPEN;

    return characteristic_add(p_rws->service_handle, &add_char_params, &p_rws->tx_handles);
    /**@snippet [Adding proprietary characteristic to the SoftDevice] */
}


uint32_t ble_rws_send_data(ble_rws_t* p_rws, uint8_t* p_data, uint16_t* p_length, uint16_t conn_handle)
{
    ret_code_t                 err_code;
    ble_gatts_hvx_params_t     hvx_params;
    ble_rws_client_context_t* p_client;

    VERIFY_PARAM_NOT_NULL(p_rws);

    err_code = blcm_link_ctx_get(p_rws->p_link_ctx_storage, conn_handle, (void*)&p_client);
    VERIFY_SUCCESS(err_code);

    if ((conn_handle == BLE_CONN_HANDLE_INVALID) || (p_client == NULL))
    {
        return NRF_ERROR_NOT_FOUND;
    }

    if (!p_client->is_notification_enabled)
    {
        return NRF_ERROR_INVALID_STATE;
    }

    if (*p_length > BLE_RWS_MAX_DATA_LEN)
    {
        return NRF_ERROR_INVALID_PARAM;
    }

    memset(&hvx_params, 0, sizeof(hvx_params));

    hvx_params.handle = p_rws->tx_handles.value_handle;
    hvx_params.p_data = p_data;
    hvx_params.p_len  = p_length;
    hvx_params.type   = BLE_GATT_HVX_NOTIFICATION;

    return sd_ble_gatts_hvx(conn_handle, &hvx_params);
}

uint32_t ble_rws_try_to_send(ble_rws_t* rws, uint8_t* data, uint16_t* pLength, uint16_t connHandle)
{
    uint32_t err_code;
    err_code = ble_rws_send_data(rws, data, pLength, connHandle);
    return (err_code == NRF_SUCCESS);
}